tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
#ifndef NATIVE_BUILD

#include "web/FaucetWeb.h"

#include "app/AppController.h"
#include "app/AppConfig.h"
#include "app/ConfigStore.h"
#include "app/FilterStore.h"
#include "app/WaterLogFileStore.h"
#include "web/FaucetWebJson.h"
#include "web/FaucetWebRoutes.h"

#include <Esp32Base.h>
#include <cstdarg>
#include <cstdio>
#include <cstdlib>
#include <cstring>

namespace faucet {
namespace {

FaucetWebContext g_context{};

bool requireContext();
bool getParam(const char* name, char* out, std::size_t len);
bool parseU32(const char* text, std::uint32_t& value);

Esp32BaseWeb::Method toBaseMethod(FaucetWebMethod method) {
    switch (method) {
        case FaucetWebMethod::Get:
            return Esp32BaseWeb::METHOD_GET;
        case FaucetWebMethod::Post:
            return Esp32BaseWeb::METHOD_POST;
        case FaucetWebMethod::Any:
        default:
            return Esp32BaseWeb::METHOD_ANY;
    }
}

void sendFmt(const char* fmt, ...) {
    char buffer[256]{};
    va_list args;
    va_start(args, fmt);
    std::vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);
    Esp32BaseWeb::sendChunk(buffer);
}

void formatLiters(std::uint32_t ml, char* out, std::size_t len) {
    const std::uint32_t centiliters = (ml + 5UL) / 10UL;
    std::snprintf(out, len, "%lu.%02lu L", static_cast<unsigned long>(centiliters / 100UL),
                  static_cast<unsigned long>(centiliters % 100UL));
}

void sendLiters(std::uint32_t ml) {
    char text[24]{};
    formatLiters(ml, text, sizeof(text));
    Esp32BaseWeb::sendChunk(text);
}

void sendAppLinks() {
    Esp32BaseWeb::sendChunk("<style>"
                            "body>nav{display:none}"
                            ".faucet-nav{display:flex;flex-wrap:wrap;gap:6px;margin:0 0 14px;padding-bottom:10px;border-bottom:1px solid #eee}"
                            ".faucet-nav a{display:inline-flex;align-items:center;min-height:34px;line-height:1.2;margin:0;white-space:nowrap}"
                            ".base-links{display:flex;flex-wrap:wrap;gap:6px;margin:0 0 18px;padding-bottom:10px;border-bottom:1px solid #eee}"
                            ".base-links span{display:inline-flex;align-items:center;color:#666;font-size:.88em;margin-right:2px}"
                            ".base-links a{background:#666;display:inline-flex;align-items:center;min-height:30px;line-height:1.2;margin:0;white-space:nowrap;font-size:.86em}"
                            ".faucet-actions{display:flex;flex-wrap:wrap;gap:6px;margin:0 0 14px}"
                            ".faucet-actions a{display:inline-flex;align-items:center;min-height:34px;line-height:1.2;margin:0;white-space:nowrap}"
                            ".info{display:none}"
                            "select{width:100%;padding:7px;margin:4px 0 12px;border:1px solid #ccc;border-radius:3px;box-sizing:border-box}"
                            ".panel{border:1px solid #ddd;border-radius:6px;padding:12px;margin:0 0 14px;background:#fafafa}"
                            ".panel h3{margin:0 0 10px}"
                            ".grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(220px,1fr));gap:10px 12px}"
                            ".field{display:block;margin:0}"
                            ".field span{display:block;font-size:.9em;color:#444;margin-bottom:4px}"
                            ".field input{margin:0}"
                            ".hint{display:block;color:#777;font-size:.82em;margin:4px 0 0}"
                            ".check{display:block;margin:6px 0 0}"
                            "table{width:100%;border-collapse:collapse;margin-bottom:14px}"
                            "td,th{padding:6px 4px;border-bottom:1px solid #eee;text-align:left}"
                            "</style>"
                            "<nav class='faucet-nav'><a href='/faucet'>状态</a><a href='/faucet/config'>配置</a>"
                            "<a href='/faucet/stats'>统计</a><a href='/faucet/logs'>记录</a>"
                            "<a href='/faucet/filters'>滤芯</a><a href='/faucet/calibration'>校准</a></nav>"
                            "<div class='base-links'><span>基础功能</span><a href='/esp32base'>首页</a>"
                            "<a href='/esp32base/wifi'>WiFi</a><a href='/esp32base/ota'>OTA</a>"
                            "<a href='/esp32base/logs'>系统日志</a><a href='/esp32base/reboot'>重启</a></div>");
}

bool sendPageStart(const char* title) {
    if (!Esp32BaseWeb::checkAuth()) {
        return false;
    }
    Esp32BaseWeb::sendHeader(title);
    sendAppLinks();
    return true;
}

void sendPageEnd() {
    Esp32BaseWeb::sendFooter();
}

const char* stateText(WaterState state) {
    switch (state) {
        case WaterState::Idle:
            return "待机";
        case WaterState::Confirm:
            return "确认";
        case WaterState::Running:
            return "出水中";
        case WaterState::Paused:
            return "暂停";
        case WaterState::Error:
            return "异常";
    }
    return "未知";
}

const char* modeText(WaterMode mode) {
    switch (mode) {
        case WaterMode::Volume:
            return "容量";
        case WaterMode::Time:
            return "时间";
        case WaterMode::Calibration:
            return "校准";
    }
    return "未知";
}

const char* resultText(WaterResult result) {
    switch (result) {
        case WaterResult::Completed:
            return "完成";
        case WaterResult::StoppedByUser:
            return "手动停止";
        case WaterResult::SafetyStopped:
            return "安全停止";
        case WaterResult::FlowError:
            return "流量异常";
        case WaterResult::PauseTimeout:
            return "暂停超时";
    }
    return "未知";
}

void sendTextInput(const char* label, const char* name, unsigned long value) {
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'></label>", label, name, value);
}

void sendVolumeInput(const char* label, const char* name, std::uint32_t value) {
    char liters[24]{};
    formatLiters(value, liters, sizeof(liters));
    sendFmt("<label class='field'><span>%s</span><input name='%s' value='%lu'><small class='hint'>当前 %s</small></label>",
            label,
            name,
            static_cast<unsigned long>(value),
            liters);
}

void sendCheckbox(const char* label, const char* name, bool checked) {
    sendFmt("<label class='check'><input type='checkbox' name='%s' value='1'%s> %s</label>",
            name,
            checked ? " checked" : "",
            label);
}

void handleFaucetPage() {
    if (!sendPageStart("出水龙头")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const AppSnapshot snapshot = g_context.app->snapshot();
    Esp32BaseWeb::sendChunk("<h2>状态</h2><table>");
    sendFmt("<tr><td>运行状态</td><td>%s</td></tr>", stateText(snapshot.water.state));
    sendFmt("<tr><td>当前预设</td><td>%u</td></tr>", static_cast<unsigned>(snapshot.water.selectedPreset + 1));
    sendFmt("<tr><td>出水模式</td><td>%s</td></tr>", modeText(snapshot.water.mode));
    Esp32BaseWeb::sendChunk("<tr><td>已出水量</td><td>");
    sendLiters(snapshot.water.volumeMl);
    Esp32BaseWeb::sendChunk("</td></tr>");
    if (snapshot.water.mode == WaterMode::Time) {
        sendFmt("<tr><td>目标值</td><td>%lu 秒</td></tr>", static_cast<unsigned long>(snapshot.water.targetValue));
    } else {
        Esp32BaseWeb::sendChunk("<tr><td>目标值</td><td>");
        sendLiters(snapshot.water.targetValue);
        Esp32BaseWeb::sendChunk("</td></tr>");
    }
    sendFmt("<tr><td>电磁阀</td><td>%s</td></tr>", snapshot.water.valveOpen ? "开启" : "关闭");
    Esp32BaseWeb::sendChunk("</table><h2>统计</h2><table>");
    Esp32BaseWeb::sendChunk("<tr><td>今日</td><td>");
    sendLiters(snapshot.statistics.todayMl);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>本周</td><td>");
    sendLiters(snapshot.statistics.weekMl);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>本月</td><td>");
    sendLiters(snapshot.statistics.monthMl);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>总累计</td><td>");
    sendLiters(snapshot.statistics.totalMl);
    Esp32BaseWeb::sendChunk("</td></tr>");
    Esp32BaseWeb::sendChunk("</table>");
    sendPageEnd();
}

void handleConfigPage() {
    if (!sendPageStart("出水配置")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const SystemConfig& config = *g_context.config;
    Esp32BaseWeb::sendChunk("<h2>配置</h2><form method='post' action='/api/faucet/config' onsubmit='return once(this)'>"
                            "<section class='panel'><h3>安全限制</h3><div class='grid'>");
    sendTextInput("二次确认超时（秒）", "confirmTimeoutSec", config.confirmTimeoutSec);
    sendTextInput("最长出水时间（秒）", "maxOutTimeSec", config.maxOutTimeSec);
    sendVolumeInput("最大出水量（ml）", "maxOutVolumeMl", config.maxOutVolumeMl);
    sendTextInput("超量保护比例（%）", "overflowPercent", config.overflowPercent);
    Esp32BaseWeb::sendChunk("</div></section><section class='panel'><h3>流量保护</h3><div class='grid'>");
    sendTextInput("无流量超时（秒）", "noFlowTimeoutSec", config.noFlowTimeoutSec);
    sendTextInput("高流量阈值（ml/min）", "highFlowMlPerMin", config.highFlowMlPerMin);
    sendTextInput("高流量持续时间（秒）", "highFlowDurationSec", config.highFlowDurationSec);
    sendTextInput("暂停超时（秒）", "pauseTimeoutSec", config.pauseTimeoutSec);
    Esp32BaseWeb::sendChunk("</div></section><section class='panel'><h3>电磁阀</h3><div class='grid'>");
    sendTextInput("电磁阀全功率时间（秒）", "valveFullPowerSec", config.valveFullPowerSec);
    sendTextInput("电磁阀保持占空比（%）", "valveHoldDutyPercent", config.valveHoldDutyPercent);
    Esp32BaseWeb::sendChunk("</div></section><section class='panel'><h3>本地交互</h3><div class='grid'>");
    sendTextInput("OLED 熄屏时间（秒）", "oledSleepSec", config.oledSleepSec);
    Esp32BaseWeb::sendChunk("<div>");
    sendCheckbox("启用蜂鸣器", "beepEnabled", config.beepEnabled);
    Esp32BaseWeb::sendChunk("</div></div></section><input type='submit' value='保存'></form>");
    sendPageEnd();
}

